chore: update pnpm-workspace.yaml to allow esbuild install script and import mermaid and vitepress-mermaid-plugin to show mermaid in vitepress
